Repository: finik404/flutter-test
Catalog: lib/languages/_*.arb
Languages: kk

source: Error
kk: Қате

# errors_required
source: This field cannot be empty
kk: Бұл өріс бос болуы мүмкін емес

# errors_email
source: Invalid email address
kk: Қате электрондық пошта

# errors_min
source: The field must be at least {length} characters
kk: Өріс кем дегенде {length} таңбалар болуы керек

# errors_max
source: The field cannot exceed {length} characters
kk: Өріс бұдан артық болуы мүмкін емес {length} таңбалар

# errors_password_confirm
source: Passwords do not match
kk: Құпия сөздер бірдей емес

# errors_password_required
source: Enter the password
kk: Құпия сөзді енгізіңіз

# errors_password_min
source: The password must contain a minimum of {length} characters
kk: Құпия сөзде ең аз {length} таңбалар болуы керек

# errors_password_max
source: The password must not exceed {length} characters
kk: Құпия сөз {length} таңбаларынан аспауы керек

# errors_password_digit
source: The password must contain at least one digit
kk: Парольде кем дегенде бір сан болуы керек

# errors_password_letter
source: The password must contain at least one lowercase letter
kk: Құпия сөзде кем дегенде бір кіші әріп болуы керек

# errors_password_upper_letter
source: The password must contain at least one uppercase letter
kk: Құпия сөзде кем дегенде бір бас әріп болуы керек

# errors_password_symbol
source: The password must contain at least one special character
kk: Құпия сөзде кем дегенде бір арнайы таңба болуы керек

# errors_email_unique
source: This email is already in use
kk: Бұл пошта қазірдің өзінде қолданылады

# errors_auth
source: Invalid email or password
kk: Қате пошта немесе құпия сөз

# errors_image_size
source: File size must not exceed {size} MB
kk: Файл өлшемі {size} МБ аспауы керек

# errors_image_type
source: Invalid image format. Acceptable formats: PNG, JPEG, JPG
kk: Жарамсыз кескін пішімі. Жарамды форматтар: PNG, JPEG, JPG

# errors_network
source: No internet connection
kk: Интернет байланысы жоқ

# errors_network_text
source: Please check your internet connection and try again
kk: Интернет байланысын тексеріп, қайталап көріңіз

# errors_code
source: Enter the recovery code
kk: қалпына келтіру кодын енгізіңіз

# errors_code_length
source: The code must be 4-digit
kk: Код 4 таңбалы болуы керек

# errors_auth_code
source: Invalid recovery code
kk: Қалпына келтіру коды дұрыс емес

# errors_phone
source: Invalid phone number format
kk: Телефон нөмірі пішімі жарамсыз
